---
title: EnergyAnalysisFailures
classe: Autodesk.Revit.DB.BuiltInFailures+EnergyAnalysisFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 28
---

# EnergyAnalysisFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ComputeRoomVolumeNotCheckedWarn { get; }` | `EnergyAnalysisFailures.ComputeRoomVolumeNotCheckedWarn` | FailureDefinitionId |
| `FailureDefinitionId ModelWithNoConditionedSpacesWarn { get; }` | `EnergyAnalysisFailures.ModelWithNoConditionedSpacesWarn` | FailureDefinitionId |
| `FailureDefinitionId ModelWithNoOccupiedSpacesWarn { get; }` | `EnergyAnalysisFailures.ModelWithNoOccupiedSpacesWarn` | FailureDefinitionId |
| `FailureDefinitionId NoRoofsRoomBoundingWarn { get; }` | `EnergyAnalysisFailures.NoRoofsRoomBoundingWarn` | FailureDefinitionId |
| `FailureDefinitionId NoRoofsSpacesBoundingWarn { get; }` | `EnergyAnalysisFailures.NoRoofsSpacesBoundingWarn` | FailureDefinitionId |
| `FailureDefinitionId NoRoomBoundingElements { get; }` | `EnergyAnalysisFailures.NoRoomBoundingElements` | FailureDefinitionId |
| `FailureDefinitionId NoRoomBoundingElementsWarn { get; }` | `EnergyAnalysisFailures.NoRoomBoundingElementsWarn` | FailureDefinitionId |
| `FailureDefinitionId NoRoomsWarn { get; }` | `EnergyAnalysisFailures.NoRoomsWarn` | FailureDefinitionId |
| `FailureDefinitionId NoSpaceBoundingElements { get; }` | `EnergyAnalysisFailures.NoSpaceBoundingElements` | FailureDefinitionId |
| `FailureDefinitionId NoSpaceBoundingElementsWarn { get; }` | `EnergyAnalysisFailures.NoSpaceBoundingElementsWarn` | FailureDefinitionId |
| `FailureDefinitionId NoSpaces { get; }` | `EnergyAnalysisFailures.NoSpaces` | FailureDefinitionId |
| `FailureDefinitionId NoSpacesWarn { get; }` | `EnergyAnalysisFailures.NoSpacesWarn` | FailureDefinitionId |
| `FailureDefinitionId PlenumWithNoCeilingWarn { get; }` | `EnergyAnalysisFailures.PlenumWithNoCeilingWarn` | FailureDefinitionId |
| `FailureDefinitionId ProblemWithLightingLoadWarn { get; }` | `EnergyAnalysisFailures.ProblemWithLightingLoadWarn` | FailureDefinitionId |
| `FailureDefinitionId ProblemWithPeopleLoadWarn { get; }` | `EnergyAnalysisFailures.ProblemWithPeopleLoadWarn` | FailureDefinitionId |
| `FailureDefinitionId ProblemWithPowerLoadWarn { get; }` | `EnergyAnalysisFailures.ProblemWithPowerLoadWarn` | FailureDefinitionId |
| `FailureDefinitionId RoomGeometryCannotFindFreeFacesBoundingElement { get; }` | `EnergyAnalysisFailures.RoomGeometryCannotFindFreeFacesBoundingElement` | FailureDefinitionId |
| `FailureDefinitionId RoomGeometryCannotOverlapBoundingElement { get; }` | `EnergyAnalysisFailures.RoomGeometryCannotOverlapBoundingElement` | FailureDefinitionId |
| `FailureDefinitionId RoomGeometryCannotTrimBoundingElement { get; }` | `EnergyAnalysisFailures.RoomGeometryCannotTrimBoundingElement` | FailureDefinitionId |
| `FailureDefinitionId RoomNotPlacedWarn { get; }` | `EnergyAnalysisFailures.RoomNotPlacedWarn` | FailureDefinitionId |
| `FailureDefinitionId RoomNotUpperBoundedByElement { get; }` | `EnergyAnalysisFailures.RoomNotUpperBoundedByElement` | FailureDefinitionId |
| `FailureDefinitionId RoomVolumeNegativeWarn { get; }` | `EnergyAnalysisFailures.RoomVolumeNegativeWarn` | FailureDefinitionId |
| `FailureDefinitionId RoomVolumeNotComputedWarn { get; }` | `EnergyAnalysisFailures.RoomVolumeNotComputedWarn` | FailureDefinitionId |
| `FailureDefinitionId SpaceResolutionOutOfRange { get; }` | `EnergyAnalysisFailures.SpaceResolutionOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId SurfaceResolutionOutOfRange { get; }` | `EnergyAnalysisFailures.SurfaceResolutionOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId UndefinedRooms { get; }` | `EnergyAnalysisFailures.UndefinedRooms` | FailureDefinitionId |
| `FailureDefinitionId UndefinedSpaces { get; }` | `EnergyAnalysisFailures.UndefinedSpaces` | FailureDefinitionId |
| `FailureDefinitionId ZoneWithoutSpacesWarn { get; }` | `EnergyAnalysisFailures.ZoneWithoutSpacesWarn` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```